{
  "_name_or_path": "Wi/arxiv-topics-distilbert-base-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Astrophysics",
    "1": "Condensed Matter",
    "2": "Computer Science",
    "3": "Economics",
    "4": "Electrical Engineering and Systems Science",
    "5": "General Relativity and Quantum Cosmology",
    "6": "High Energy Physics - Experiment",
    "7": "High Energy Physics - Lattice",
    "8": "High Energy Physics - Phenomenology",
    "9": "High Energy Physics - Theory",
    "10": "Mathematics",
    "11": "Mathematical Physics",
    "12": "Nonlinear Sciences",
    "13": "Nuclear Experiment",
    "14": "Nuclear Theory",
    "15": "Physics",
    "16": "Quantitative Biology",
    "17": "Quantitative Finance",
    "18": "Quantum Physics",
    "19": "Statistics",
    "20": "Other"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Astrophysics": 0,
    "Computer Science": 2,
    "Condensed Matter": 1,
    "Economics": 3,
    "Electrical Engineering and Systems Science": 4,
    "General Relativity and Quantum Cosmology": 5,
    "High Energy Physics - Experiment": 6,
    "High Energy Physics - Lattice": 7,
    "High Energy Physics - Phenomenology": 8,
    "High Energy Physics - Theory": 9,
    "Mathematical Physics": 11,
    "Mathematics": 10,
    "Nonlinear Sciences": 12,
    "Nuclear Experiment": 13,
    "Nuclear Theory": 14,
    "Other": 20,
    "Physics": 15,
    "Quantitative Biology": 16,
    "Quantitative Finance": 17,
    "Quantum Physics": 18,
    "Statistics": 19
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "vocab_size": 28996
}
